# Assign Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectContext3DHandleOverrides..::..Assign Method
DirectContext3DHandleOverrides Class See Also
---
Assigns values of the source overrides to this object.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void Assign(
	DirectContext3DHandleOverrides other
)
```

Visual Basic
---
```text
Public Sub Assign ( _
	other As DirectContext3DHandleOverrides _
)
```

Visual C++
---
```text
public:
void Assign(
	DirectContext3DHandleOverrides^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.DirectContext3D..::..DirectContext3DHandleOverrides The source overrides.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectContext3DHandleOverrides Class
Autodesk.Revit.DB.DirectContext3D Namespace